const harmRules = {

  // "己甲"、"乙庚"等组合都是按Unicode升序排列
  // ====================================================================
  // 天干关系
  // =================================e====================================
  tiangan: {
    // 天干五合，有"合化"的概念，result代表可能合化成的五行，根据力量可能有多种结果，用"/"区分
    "己甲": { "type": ["五合"], "result": "土/木" }, // 中正之合
    "乙庚": { "type": ["五合"], "result": "金/木" }, // 仁义之合
    "丙辛": { "type": ["五合"], "result": "水/火/金" }, // 威制之合
    "丁壬": { "type": ["五合"], "result": "木/火/水" }, // 淫匿之合
    "戊癸": { "type": ["五合"], "result": "火/土/水" }, // 无情之合

    // 天干四冲（相克）
    "庚甲": { "type": ["四冲"] }, 
    "乙辛": { "type": ["四冲"] },
    "丙壬": { "type": ["四冲"] },
    "丁癸": { "type": ["四冲"] },
  },

  // ====================================================================
  // 地支关系（两个地支）
  // ====================================================================
  dizhi_2_char: {
    // --- 六合 ---
    // result 代表合化后的五行
    "丑子": { "type": ["六合"], "result": "土" },
    "卯戌": { "type": ["六合"], "result": "火" },
    "辰酉": { "type": ["六合"], "result": "金" },
    "午未": { "type": ["六合"], "result": "火/土" }, // 午未合，主流认为合为火，也有认为合为土

    // --- 特殊的合，同时包含其他关系 ---
    // result_map 用于当一个组合有多种关系时，指明特定关系下的合化结果
    "亥寅": { "type": ["六合", "六破"], "result": "木" }, // 合中带破，关系复杂，吉中藏凶
    "巳申": { "type": ["六合", "相刑", "六破"], "result": "水" }, // 刑合带破，关系最为复杂多变

    // --- 六冲 ---
    "丑未": { "type": ["六冲", "相刑"] },
    "寅申": { "type": ["六冲", "相刑"] },
    "午子": { "type": ["六冲"] },
    "卯酉": { "type": ["六冲"] },
    "戌辰": { "type": ["六冲"] },
    "亥巳": { "type": ["六冲"] },

    // --- 暗合 ---
    "子巳": { "type": ["暗合"], "result": "（戊癸）" },
    "亥午": { "type": ["全暗合"] , "result": "（盲派专用）" },
    "丑寅": { "type": ["全暗合"] , "result": "（盲派专用）" },
    "卯申": { "type": ["暗合"] , "result": "（盲派专用）" },
    "午寅": { "type": ["暗合", "半合"], "result_map": { "暗合": "（甲己）", "半合": "火" } }, 
    "巳酉": { "type": ["暗合", "半合"], "result_map": { "暗合": "（丙辛）", "半合": "金" } }, 

    // --- 半合（三合局缺中间的字） ---
    "子申": { "type": ["半合"], "result": "水" },
    "子辰": { "type": ["半合"], "result": "水" },
    "寅戌": { "type": ["半合"], "result": "火" },
    "丑巳": { "type": ["半合"], "result": "金" },
    "午戌": { "type": ["半合"], "result": "火" },
    "申辰": { "type": ["半合"], "result": "水" },
    "丑酉": { "type": ["半合"], "result": "金" },
    "亥卯": { "type": ["半合"], "result": "木" },
    "卯未": { "type": ["半合"], "result": "木" },
    "亥未": { "type": ["半合"], "result": "木" },
    
    // --- 破（相破） ---
    // 部分"破"的关系与"合"、"刑"等重叠，已在上面定义
    "子酉": { "type": ["六破"] },
    "丑辰": { "type": ["六破", "盲派三破"] }, 
    "午卯": { "type": ["六破", "盲派三破"] }, 
    "戌未": { "type": ["六破", "盲派四刑", "相刑"] }, //盲派四刑，传言比普通相刑更准确，故特添加以留意观察
    "丑戌": { "type": ["盲派四刑", "相刑"] },
    "卯子": { "type": ["盲派四刑", "相刑"] },

    // --- 穿（相害） ---
    "子未": { "type": ["六穿"] },
    "亥申": { "type": ["六穿"] },
    "戌酉": { "type": ["六穿"] },
    "丑午": { "type": ["六穿"] },
    "卯辰": { "type": ["六穿"] },
    "寅巳": { "type": ["六穿", "相刑", "盲派四刑"] }, 
  },

  // ====================================================================
  // 地支关系（三个地支）
  // ====================================================================
  dizhi_3_char: {
    // --- 三会 ---
    "丑亥子": { "type": ["三会"], "result": "水" }, 
    "卯寅辰": { "type": ["三会"], "result": "木" }, 
    "午巳未": { "type": ["三会"], "result": "火" }, 
    "戌申酉": { "type": ["三会"], "result": "金" }, 

    // --- 三合 ---
    "子申辰": { "type": ["三合"], "result": "水" },
    "亥卯未": { "type": ["三合"], "result": "木" },
    "午寅戌": { "type": ["三合"], "result": "火" },
    "丑巳酉": { "type": ["三合"], "result": "金" },

    // --- 三刑 ---
    "丑戌未": { "type": ["三刑"] },
    "寅巳申": { "type": ["三刑"] },
  },
  
  // ====================================================================
  // 地支关系（自身）
  // ====================================================================
  dizhi_self: {
    // --- 自刑 ---
    "辰辰": { "type": ["自刑"] },
    "午午": { "type": ["自刑"] },
    "酉酉": { "type": ["自刑"] },
    "亥亥": { "type": ["自刑"] },
  }
};

export default harmRules;